app/xml/brainsys-services/ConsultaStockRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bra="http://brainsys.com.ar/">
   <soapenv:Header/>
   <soapenv:Body>
      <bra:obtenerStock>
         <!--Optional:-->
         <bra:sesion>
            <!--Optional:-->
            <bra:usuario>
               <bra:usua_id>24</bra:usua_id>
               <!--Optional:-->
               <bra:usua_nombre>south</bra:usua_nombre>
               <!--Optional:-->
               <bra:usua_clie_id>00000SO001</bra:usua_clie_id>
               <!--Optional:-->
               <bra:usua_estadoPorDefecto>DIS</bra:usua_estadoPorDefecto>
               <bra:usua_vencimientoPassword>0</bra:usua_vencimientoPassword>
               <bra:usua_ingreso>2016-05-31T00:00:00</bra:usua_ingreso>
               <!--Optional:-->
               <bra:usua_password>2E1F8C5970776B28E9F2E1D60E1EAD0E0571E715</bra:usua_password>
               <bra:usua_altaPassword>2016-05-31T00:00:00</bra:usua_altaPassword>
            </bra:usuario>
            <bra:fecha>2019-06-13T00:00:00-03:00</bra:fecha>
         </bra:sesion>
         <!--Optional:-->
         <bra:filtro>
            <bra:fechaDesde>2019-06-13</bra:fechaDesde>
            <!-- <bra:fechaHasta></bra:fechaHasta>
            <bra:compania></bra:compania>
            <bra:producto></bra:producto>
            <bra:lote></bra:lote> -->
         </bra:filtro>
      </bra:obtenerStock>
   </soapenv:Body>
</soapenv:Envelope>